PI=float(3.1415926) #задаём значение числа пи, можно также это сделать math.pi, но я предпочёл не подгружать лишние модули и библиотеки, такой точности расчётов нам хватит
r=float((input('Введите радиус круга в сантиметрах: '))) #просим пользователя ввести радиус в сантиметрах
if r>=0:
   print(f'Длина окружности с заданным радиусом в сантиметрах: {2*PI*r}, в метрах: {PI*r/50}') #вычисление длины окружности
   print(f'Площадь круга в сантиметрах: {PI*r**2} , в метрах: {PI*(r/100)**2}') #вычисление плозади круга
   print(f'Сторона вписанного в окружность квадрата в сантиметрах: {r*2**(1/2)}, в метрах: {r*2**(1/2)/100} ') #вычисление стороны вписанного в окружность квдрата
   print(f'Сторона вписанного в окружность равностороннего треугольника в сантиметрах: {r*3**(1/2)}, в метрах: {r*3*(1/2)/100} ') #вычисление стороны вписанного в окружность равностороннего треугольника
   print(f'Сторона квадрата описанного около окружности в сантиметрах: {2*r} , в метрах: {r/50}') #вычисление стороны квадрата описанного около окружности
   print(f'Сторона описанного около окружности равностороннего треугольника в сантиметрах: {(6*r)/(3**(1/2))} , в метрах: {(6*r)/(3**(1/2))/100}') #вычисление стороны описанного около окружности равностороннего треугольника
   print(f'Сторона описанного около окружности правильного восьмиугольника в сантиметрах: {(2*r)*(2**(1/2)-1)} , в метрах {(2*r)*(2**(1/2)-1)/100}') #вычисление стороны описанного около окружности правильного восьмиугольника
else: 
   print('Введите положительное число') #в случаях когда число будет меньше 0 (отрицательное), будет выводиться данное сообщение
   