PI=3.1415926
 #задаём значение числа пи, можно также это сделать math.pi, но я предпочёл не подгружать лишние модули и библиотеки, такой точности расчётов нам хватит

r=float(input('Введите радиус круга в сантиметрах: '))
#просим пользователя ввести радиус в сантиметрах

#если радиус введён корректно (больше 0)
if r>0:

   #вычисление длины окружности
   print(f'Длина окружности с заданным радиусом в сантиметрах: {2*PI*r}, в метрах: {PI*r/50}') 

   #вычисление площади круга
   print(f'Площадь круга в квадратных сантиметрах: {PI*r**2} , в квадратных метрах: {PI*(r/100)**2}')

   #вычисление стороны вписанного в окружность квадрата
   print(f'Сторона вписанного в окружность квадрата в сантиметрах: {r*2**(1/2)}, в метрах: {r*2**(1/2)/100} ') 

   #вычисление стороны вписанного в окружность равностороннего треугольника
   print(f'Сторона вписанного в окружность равностороннего треугольника в сантиметрах: {r*3**(1/2)}, в метрах: {r*3**(1/2)/100} ') 

   #вычисление стороны квадрата описанного около окружности
   print(f'Сторона квадрата описанного около окружности в сантиметрах: {2*r} , в метрах: {r/50}') 

   #вычисление стороны описанного около окружности равностороннего треугольника
   print(f'Сторона описанного около окружности равностороннего треугольника в сантиметрах: {(6*r)/(3**(1/2))} , в метрах: {(6*r)/(3**(1/2))/100}') 

   #вычисление стороны описанного около окружности правильного восьмиугольника
   print(f'Сторона описанного около окружности правильного восьмиугольника в сантиметрах: {(2*r)*(2**(1/2)-1)} , в метрах: {(2*r)*(2**(1/2)-1)/100}') 

else: 
   #в случаях когда пользователь вводит неположительный радиус, будет выводиться данное сообщение
   print('Введите положительное число') 
   