PI=float(3.1415926) #введём переменную пи, можно использовать math.pi но я решил не перегружать код ради этого
r=float((input('Введите радиус круга в сантиметрах: '))) #пользователь вводит радиус
print(f'Длина окружности с заданным радиусом в сантиметрах: {2*PI*r}, в метрах: {PI*r/50}')
print(f'Площадь круга в сантиметрах: {PI*r**2} , в метрах: {PI*(r/100)**2}')
print(f'Сторона вписанного в окружность квадрата в сантиметрах: {r*2**(1/2)}, в метрах: {r*2**(1/2)/100} ')
print(f'Сторона вписанного в окружность равностороннего треугольника в сантиметрах: {r*3**(1/2)}, в метрах: {r*3**(1/2)/100} ')
print(f'Сторона квадрата описанного около окружности в сантиметрах: {2*r} , в метрах: {r/50}')
print(f'Сторона описанного около окружности равностороннего треугольника в сантиметрах: {(6*r)/(3**(1/2))} , в метрах: {((6*r)/(3**(1/2)))/100}')
print(f'Сторона описанного около окружности правильного восьмиугольника в сантиметрах: {(2*r)*(2**(1/2)-1)} , в метрах {((2*r)*(2**(1/2)-1))/100}')
#3-9 строки это вычисления